<a href="https://colab.research.google.com/github/GregoDs/DSassignments.all/blob/main/Subqueries_using_Select_Statements_assignment_cities%2Ccountries.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [19]:
# We will first load the sql extension into our environment
%load_ext sql

# Then connect to our in memory sqlite database
# NB: This database will cease to exist as soon as the database connection is closed. 
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @None'

In [20]:
# Importing Pandas
import pandas as pd

In [4]:
# Loading our Countries dataset
# 
with open('/content/world_countries.csv','r') as f:
  Countries = pd.read_csv(f, index_col=0, encoding='utf-8') 
    
%sql DROP TABLE if EXISTS Countries;
%sql PERSIST Countries;

 * sqlite://
Done.
 * sqlite://

'Persisted countries'

In [5]:
# Loading our cities dataset 
# 
with open('/content/world_cities.csv','r') as f:
  Cities= pd.read_csv(f, index_col=0, encoding='utf-8') 
    
%sql DROP TABLE if EXISTS Cities;
%sql PERSIST Cities;

 * sqlite://
Done.
 * sqlite://

'Persisted cities'

1.2 Subqueries using the SELECT statement
A subquery is a query within another query. The outer query is called as main query and inner query is called as subquery. The subquery must be enclosed with parenthesis and generally executes first, and its output is used to complete the query condition for the main or outer query. We will go through examples of how subqueries can be used to answers different types of questions then later, we will use our learnings to work on the challenges.

In [21]:
# Example 1
# Subqueries can occur in the select list of the containing query
# as shown below;
# Let's find all countries in the Countries table with no city in the Cities table
# 
%%sql
SELECT country
FROM Countries
WHERE NOT EXISTS (SELECT * FROM Cities
                   WHERE Cities.country = Countries.country)

 * sqlite://
Done.

[('Cyprus',), ('Iceland',), ('Kosovo',), ('Liechtenstein',), ('Luxembourg',)]

In [35]:
# Example 2
# Find the European countries with cities experiencing temperature > 20?
# 
%%sql
SELECT country
FROM Countries
WHERE EU = 'yes'
AND EXISTS (SELECT * FROM Cities
            WHERE Cities.country = Countries.country
            AND temperature > 15);

 * sqlite://
Done.

[('Greece',), ('Italy',), ('Portugal',), ('Spain',)]

In [23]:

# Example 3: Method 1
# Find the westernmost city, returning the city and longitude
# 
%%sql
SELECT city, longitude
FROM Cities C1
WHERE NOT EXISTS (SELECT * FROM Cities C2
                  WHERE C2.longitude < C1.longitude)

 * sqlite://
Done.

[('Lisbon', -9.14)]

In [24]:
# Example 4:
# How many cities are in the EU?
# 
%%sql
SELECT count()
FROM Cities
WHERE country IN (SELECT country FROM Countries WHERE EU = 'yes')

 * sqlite://
Done.

[(150,)]

1.2 Challenges

In [10]:
# Challenge 1
# Find number of countries that have a city with latitude > 1000 (start with country list)
#

In [13]:
%%sql
SELECT count(country) 
From Cities 
WHERE country IN (SELECT city FROM Cities WHERE latitude > 1000 )

 * sqlite://
Done.

[(0,)]

In [12]:
# Challenge 2
# Find three western most cities returning both the cities and their longitude
#

In [14]:
%%sql
SELECT city, longitude
FROM Cities C1
where not exists (SELECT * FROM Cities C2 WHERE C2.longitude < C1.longitude)

 * sqlite://
Done.

[('Lisbon', -9.14)]

In [117]:
%%sql
SELECT city, longitude
FROM Cities
WHERE longitude = (SELECT min(longitude) FROM Cities);

 * sqlite://
Done.

[('Lisbon', -9.14)]

In [15]:
# Challenge 3
# Find cities with temperature is more than 50% higher than the average; 
# We will return the city, country, and temperature, ordered by descending temperature
# Hint: avg(temperature) * 1.5
#

In [116]:
%%sql
SELECT city,country,avg(temperature) FROM Cities 
where  EXISTS (SELECT avg(temperature) * 0.5 FROM Cities) ORDER BY temperature DESC limit 3;

 * sqlite://
Done.

[('Zurich', 'Switzerland', 9.497840375586858)]

In [ ]:
# Challenge 4
# How many cities are not in the EU and without a coastline?
# Hint: "not in"
#

In [49]:
%%sql
SELECT count()
FROM Cities
Where Country not IN (SELECT country FROM Countries WHERE EU = 'yes' AND coastline = 'yes' )

 * sqlite://
Done.

[(77,)]

In [ ]:
#]# Challenge 5
# Find the number of countries with no coastline and a city with longitude < 10
#

In [81]:
%%sql
SELECT count()
FROM Countries
where country IN (SELECT count(country) FROM Cities WHERE  longitude < 10 ) ;

 * sqlite://
Done.

[(0,)]

In [ ]:
# Challenge 6
# Find countries in Countries table with no city in Cities table
#

In [102]:
%%sql
SELECT country
FROM Countries
WHERE NOT EXISTS (SELECT * FROM Cities
                  WHERE Cities.country = Countries.country) ;

 * sqlite://
Done.

[('Cyprus',), ('Iceland',), ('Kosovo',), ('Liechtenstein',), ('Luxembourg',)]

In [ ]:
# Challenge 7
# Find all cities in a country whose population is < 2, returning the city and country.
#

In [104]:
%%sql
SELECT city,country from Cities where exists (SELECT * FROM Countries
                                      WHERE Countries.country = Cities.country 
                                      and population < 2 );

 * sqlite://
Done.

[('Andorra', 'Andorra'),
 ('Daugavpils', 'Latvia'),
 ('Podgorica', 'Montenegro'),
 ('Riga', 'Latvia'),
 ('Tallinn', 'Estonia'),
 ('Tartu', 'Estonia')]

In [ ]:
# Challenge 8
# Find all countries with no city having a temperature > 6
#

In [113]:
%%sql
SELECT country,city  FROM Cities
WHERE temperature < 6 ;

 * sqlite://
Done.

[('Sweden', 'Abisko'),
 ('Germany', 'Augsburg'),
 ('Norway', 'Bergen'),
 ('Norway', 'Bodo'),
 ('Ukraine', 'Chernihiv'),
 ('Latvia', 'Daugavpils'),
 ('Turkey', 'Erzurum'),
 ('Sweden', 'Göteborg'),
 ('Finland', 'Helsinki'),
 ('Austria', 'Innsbruck'),
 ('Sweden', 'Kiruna'),
 ('Belarus', 'Minsk'),
 ('Belarus', 'Orsha'),
 ('Norway', 'Oslo'),
 ('Finland', 'Oulu'),
 ('Latvia', 'Riga'),
 ('Austria', 'Salzburg'),
 ('Norway', 'Stavanger'),
 ('Estonia', 'Tallinn'),
 ('Finland', 'Tampere'),
 ('Estonia', 'Tartu'),
 ('Norway', 'Trondheim'),
 ('Finland', 'Turku'),
 ('Sweden', 'Uppsala'),
 ('Lithuania', 'Vilnius')]